InformationRegisters/СведенияОФайлах1САрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФайлах1САрхив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокументаБИА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовБИА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовБИА</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормыПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СведенияОФайлах1САрхив/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьСведенияОФайле(ПараметрыРегистрации) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьСведений = РегистрыСведений.СведенияОФайлах1САрхив.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьСведений, ПараметрыРегистрации);
	ЗаписьСведений.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПараметрыРегистрацииСведенийОФайле() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Файл");
	ПараметрыРегистрации.Вставить("ВидДокументаБИА");
	ПараметрыРегистрации.Вставить("ИдентификаторПечатнойФормы");
	ПараметрыРегистрации.Вставить("Организация");
	ПараметрыРегистрации.Вставить("Дата");
	ПараметрыРегистрации.Вставить("Номер");
	ПараметрыРегистрации.Вставить("НеВыгружать", Истина);
	ПараметрыРегистрации.Вставить("Сотрудник");
	Возврат ПараметрыРегистрации;
КонецФункции

Функция СведенияОФайлеДляВыгрузкиВАрхив(Файл, ДополнитьСведениямиВладельца = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДополнитьСведениямиВладельца", ДополнитьСведениямиВладельца);
	Запрос.УстановитьПараметр("Файл", Файл);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Файл,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.ВидДокументаБИА, ЗНАЧЕНИЕ(Справочник.ВидыДокументовБИА.ПустаяСсылка)) КАК ВидДокументаБИА,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.НеВыгружать, ИСТИНА) КАК НеВыгружать,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.ИдентификаторПечатнойФормы, """") КАК ИдентификаторПечатнойФормы,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Номер, """") КАК НомерРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОФайлах1САрхив КАК СведенияОФайлах1САрхив
	|		ПО Файлы.Ссылка = СведенияОФайлах1САрхив.Файл
	|ГДЕ
	|	Файлы.Ссылка = &Файл";

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорПоследнегоЗапроса = ПоследнийЗапрос.Операторы[0];
	
	ОператорПоследнегоЗапроса.Источники.Заменить(0, ПоследнийЗапрос.ДоступныеТаблицы.Найти(СтрШаблон("Справочник.%1", Файл.Метаданные().Имя)));

	ПервыйИсточник = ОператорПоследнегоЗапроса.Источники[0];
	ВторойИсточник = ОператорПоследнегоЗапроса.Источники[1];
	
	Если ОбщегоНазначения.ЭтоДокумент(Файл.ВладелецФайла.Ссылка.Метаданные()) Тогда
		
		ДокументСодержитНомер = Не Файл.ВладелецФайла.Ссылка.Метаданные().ДлинаНомера = 0;
		
		НовыйИсточник = ОператорПоследнегоЗапроса.Источники.Добавить(
		"Документ."+Файл.ВладелецФайла.Метаданные().Имя, "Владелец");
		УсловиеСоединения = ПервыйИсточник.Источник.Псевдоним + ".ВладелецФайла = Владелец.Ссылка";
		ПервыйИсточник.Соединения.Добавить(НовыйИсточник.Источник.Псевдоним, УсловиеСоединения);
		ПервыйИсточник.Соединения[ПервыйИсточник.Соединения.Количество()-1].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И СокрЛП(ЕстьNULL(СведенияОФайлах1САрхив.Номер,"""")) = """"
		|		ТОГДА "+?(ДокументСодержитНомер, "Владелец.Номер", """""")+"
		|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Номер,"""")
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Номер";
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Дата, ДатаВремя(1,1,1)) = ДатаВремя(1,1,1)
		|		ТОГДА НачалоПериода(Владелец.Дата, День)
		|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Дата, ДатаВремя(1,1,1))
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Дата";
		
		Если Не Файл.ВладелецФайла.Метаданные().Реквизиты.Найти("Организация") = Неопределено Тогда
			ДобавляемоеПоле = 
			"ВЫБОР
			|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка)) = Значение(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Владелец.Организация
			|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка))
			|КОНЕЦ"; 
			
			ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
			ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Файл.ВладелецФайла.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		НовыйИсточник = ОператорПоследнегоЗапроса.Источники.Добавить("Справочник.Сотрудники", "Сотрудники");
		УсловиеСоединения = "СведенияОФайлах1САрхив.Сотрудник = Сотрудники.Ссылка";
		ВторойИсточник.Соединения.Добавить(НовыйИсточник.Источник.Псевдоним, УсловиеСоединения); 
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка)) = Значение(Справочник.Организации.ПустаяСсылка)
		|		ТОГДА Сотрудники.ГоловнаяОрганизация
		|	ИНАЧЕ ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка))
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
		
	КонецЕсли;
	
	Если ПоследнийЗапрос.Колонки.Найти("Номер") = Неопределено Тогда
		ДобавляемоеПоле = "ЕстьNULL(СведенияОФайлах1САрхив.Номер,"""")";
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Номер";
	КонецЕсли;

	Если ПоследнийЗапрос.Колонки.Найти("Дата") = Неопределено Тогда
		ДобавляемоеПоле = "ВЫБОР
		|	КОГДА ЕстьNULL(СведенияОФайлах1САрхив.Дата,ДатаВремя(1,1,1)) = ДатаВремя(1,1,1)
		|		ТОГДА ЕстьNULL(СведенияОФайлах1САрхив.Файл.ДатаСоздания, ДатаВремя(1,1,1))
		|	ИНАЧЕ ЕстьNULL(СведенияОФайлах1САрхив.Дата,ДатаВремя(1,1,1))
		|КОНЕЦ"; 
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Дата";
	КонецЕсли;
	
	Если ПоследнийЗапрос.Колонки.Найти("Организация") = Неопределено Тогда
		ДобавляемоеПоле = "ЕстьNULL(СведенияОФайлах1САрхив.Организация, Значение(Справочник.Организации.ПустаяСсылка))";
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
	КонецЕсли;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыРегистрации = ПараметрыРегистрацииСведенийОФайле();
	ПараметрыРегистрации.Вставить("ОрганизацияРегистр");
	ПараметрыРегистрации.Вставить("ДатаРегистр");
	ПараметрыРегистрации.Вставить("НомерРегистр");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
